venki666/CPE403AES/2020/workspace_v10/tirtos_builds_CC1352R1_LAUNCHXL_release_ccs/Debug/configPkg/package/cfg/release_pem4f.c
/* Object__count__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Seconds_Object__count__C, ".const:ti_sysbios_family_arm_cc26xx_Seconds_Object__count__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Object__count ti_sysbios_family_arm_cc26xx_Seconds_Object__count__C = 0;

/* Object__heap__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Seconds_Object__heap__C, ".const:ti_sysbios_family_arm_cc26xx_Seconds_Object__heap__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Object__heap ti_sysbios_family_arm_cc26xx_Seconds_Object__heap__C = NULL;

/* Object__sizeof__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Seconds_Object__sizeof__C, ".const:ti_sysbios_family_arm_cc26xx_Seconds_Object__sizeof__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Object__sizeof ti_sysbios_family_arm_cc26xx_Seconds_Object__sizeof__C = 0;

/* Object__table__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Seconds_Object__table__C, ".const:ti_sysbios_family_arm_cc26xx_Seconds_Object__table__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Object__table ti_sysbios_family_arm_cc26xx_Seconds_Object__table__C = NULL;


/*
 * ======== ti.sysbios.family.arm.cc26xx.Timer INITIALIZERS ========
 */


/* Object__PARAMS__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Timer_Object__PARAMS__C, ".const:ti_sysbios_family_arm_cc26xx_Timer_Object__PARAMS__C");
__FAR__ const ti_sysbios_family_arm_cc26xx_Timer_Params ti_sysbios_family_arm_cc26xx_Timer_Object__PARAMS__C = {
    sizeof (ti_sysbios_family_arm_cc26xx_Timer_Params), /* __size */
    NULL, /* __self */
    NULL, /* __fxns */
    (xdc_runtime_IInstance_Params*)&ti_sysbios_family_arm_cc26xx_Timer_Object__PARAMS__C.__iprms, /* instance */
    ti_sysbios_interfaces_ITimer_RunMode_CONTINUOUS,  /* runMode */
    ti_sysbios_interfaces_ITimer_StartMode_AUTO,  /* startMode */
    ((xdc_UArg)NULL),  /* arg */
    (xdc_UInt32)0x0,  /* period */
    ti_sysbios_interfaces_ITimer_PeriodType_MICROSECS,  /* periodType */
    {
        (xdc_Bits32)0x0,  /* hi */
        (xdc_Bits32)0x0,  /* lo */
    },  /* extFreq */
    ((ti_sysbios_family_arm_m3_Hwi_Params*)NULL),  /* hwiParams */
    {
        sizeof (xdc_runtime_IInstance_Params), /* __size */
        0,  /* name */
    },  /* instance */
};

/* Module__root__V */
ti_sysbios_family_arm_cc26xx_Timer_Module__ ti_sysbios_family_arm_cc26xx_Timer_Module__root__V = {
    {&ti_sysbios_family_arm_cc26xx_Timer_Module__root__V.link,  /* link.next */
    &ti_sysbios_family_arm_cc26xx_Timer_Module__root__V.link},  /* link.prev */
};

/* Object__table__V */
ti_sysbios_family_arm_cc26xx_Timer_Object__ ti_sysbios_family_arm_cc26xx_Timer_Object__table__V[1] = {
    {/* instance#0 */
        0,
        1,  /* staticInst */
        (xdc_Int)0x0,  /* id */
        ti_sysbios_interfaces_ITimer_StartMode_AUTO,  /* startMode */
        (xdc_UInt32)0xa7c5,  /* period */
        ((xdc_UArg)NULL),  /* arg */
        ((xdc_Void(*)(xdc_UArg f_arg0))(ti_sysbios_knl_Clock_doTick__I)),  /* tickFxn */
        {
            (xdc_Bits32)0x0,  /* hi */
            (xdc_Bits32)0x10000,  /* lo */
        },  /* frequency */
        (ti_sysbios_family_arm_m3_Hwi_Handle)&ti_sysbios_family_arm_m3_Hwi_Object__table__V[0],  /* hwi */
        (xdc_UInt64)0xa7c5,  /* period64 */
        (xdc_UInt64)0x0,  /* savedCurrCount */
        (xdc_UInt64)0xa7c5,  /* prevThreshold */
        (xdc_UInt64)0xa7c5,  /* nextThreshold */
    },
};

/* Module__diagsEnabled__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Timer_Module__diagsEnabled__C, ".const:ti_sysbios_family_arm_cc26xx_Timer_Module__diagsEnabled__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__diagsEnabled ti_sysbios_family_arm_cc26xx_Timer_Module__diagsEnabled__C = (xdc_Bits32)0x90;

/* Module__diagsIncluded__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Timer_Module__diagsIncluded__C, ".const:ti_sysbios_family_arm_cc26xx_Timer_Module__diagsIncluded__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__diagsIncluded ti_sysbios_family_arm_cc26xx_Timer_Module__diagsIncluded__C = (xdc_Bits32)0x90;

/* Module__diagsMask__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Timer_Module__diagsMask__C, ".const:ti_sysbios_family_arm_cc26xx_Timer_Module__diagsMask__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__diagsMask ti_sysbios_family_arm_cc26xx_Timer_Module__diagsMask__C = ((const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__diagsMask)NULL);

/* Module__gateObj__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Timer_Module__gateObj__C, ".const:ti_sysbios_family_arm_cc26xx_Timer_Module__gateObj__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__gateObj ti_sysbios_family_arm_cc26xx_Timer_Module__gateObj__C = ((const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__gateObj)NULL);

/* Module__gatePrms__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Timer_Module__gatePrms__C, ".const:ti_sysbios_family_arm_cc26xx_Timer_Module__gatePrms__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__gatePrms ti_sysbios_family_arm_cc26xx_Timer_Module__gatePrms__C = ((const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__gatePrms)NULL);

/* Module__loggerDefined__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Timer_Module__loggerDefined__C, ".const:ti_sysbios_family_arm_cc26xx_Timer_Module__loggerDefined__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__loggerDefined ti_sysbios_family_arm_cc26xx_Timer_Module__loggerDefined__C = 0;

/* Module__loggerObj__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Timer_Module__loggerObj__C, ".const:ti_sysbios_family_arm_cc26xx_Timer_Module__loggerObj__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__loggerObj ti_sysbios_family_arm_cc26xx_Timer_Module__loggerObj__C = ((const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__loggerObj)NULL);

/* Module__loggerFxn0__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Timer_Module__loggerFxn0__C, ".const:ti_sysbios_family_arm_cc26xx_Timer_Module__loggerFxn0__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__loggerFxn0 ti_sysbios_family_arm_cc26xx_Timer_Module__loggerFxn0__C = ((const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__loggerFxn0)NULL);

/* Module__loggerFxn1__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Timer_Module__loggerFxn1__C, ".const:ti_sysbios_family_arm_cc26xx_Timer_Module__loggerFxn1__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__loggerFxn1 ti_sysbios_family_arm_cc26xx_Timer_Module__loggerFxn1__C = ((const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__loggerFxn1)NULL);

/* Module__loggerFxn2__C */
#pragma DATA_SECTION(ti_sysbios_family_arm_cc26xx_Timer_Module__loggerFxn2__C, ".const:ti_sysbios_family_arm_cc26xx_Timer_Module__loggerFxn2__C");
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__loggerFxn2 ti_sysbios_family_arm_cc26xx_Timer_Module__loggerFxn2__C = ((const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__loggerFxn2)NULL);

