venki666/CPE403AES/2020/workspace_v10/tirtos_builds_CC1352R1_LAUNCHXL_release_ccs/Debug/configPkg/package/cfg/release_pem4f.c
/* deleteTerminatedTasks__C */
#pragma DATA_SECTION(ti_sysbios_knl_Task_deleteTerminatedTasks__C, ".const:ti_sysbios_knl_Task_deleteTerminatedTasks__C");
__FAR__ const CT__ti_sysbios_knl_Task_deleteTerminatedTasks ti_sysbios_knl_Task_deleteTerminatedTasks__C = 0;

/* hooks__C */
#pragma DATA_SECTION(ti_sysbios_knl_Task_hooks__C, ".const:ti_sysbios_knl_Task_hooks__C");
__FAR__ const CT__ti_sysbios_knl_Task_hooks ti_sysbios_knl_Task_hooks__C = {0, 0};

/* moduleStateCheckFxn__C */
#pragma DATA_SECTION(ti_sysbios_knl_Task_moduleStateCheckFxn__C, ".const:ti_sysbios_knl_Task_moduleStateCheckFxn__C");
__FAR__ const CT__ti_sysbios_knl_Task_moduleStateCheckFxn ti_sysbios_knl_Task_moduleStateCheckFxn__C = ((const CT__ti_sysbios_knl_Task_moduleStateCheckFxn)(ti_sysbios_knl_Task_moduleStateCheck__I));

/* moduleStateCheckValueFxn__C */
#pragma DATA_SECTION(ti_sysbios_knl_Task_moduleStateCheckValueFxn__C, ".const:ti_sysbios_knl_Task_moduleStateCheckValueFxn__C");
__FAR__ const CT__ti_sysbios_knl_Task_moduleStateCheckValueFxn ti_sysbios_knl_Task_moduleStateCheckValueFxn__C = ((const CT__ti_sysbios_knl_Task_moduleStateCheckValueFxn)(ti_sysbios_knl_Task_getModuleStateCheckValue__I));

/* moduleStateCheckFlag__C */
#pragma DATA_SECTION(ti_sysbios_knl_Task_moduleStateCheckFlag__C, ".const:ti_sysbios_knl_Task_moduleStateCheckFlag__C");
__FAR__ const CT__ti_sysbios_knl_Task_moduleStateCheckFlag ti_sysbios_knl_Task_moduleStateCheckFlag__C = 0;

/* objectCheckFxn__C */
#pragma DATA_SECTION(ti_sysbios_knl_Task_objectCheckFxn__C, ".const:ti_sysbios_knl_Task_objectCheckFxn__C");
__FAR__ const CT__ti_sysbios_knl_Task_objectCheckFxn ti_sysbios_knl_Task_objectCheckFxn__C = ((const CT__ti_sysbios_knl_Task_objectCheckFxn)(ti_sysbios_knl_Task_objectCheck__I));

/* objectCheckValueFxn__C */
#pragma DATA_SECTION(ti_sysbios_knl_Task_objectCheckValueFxn__C, ".const:ti_sysbios_knl_Task_objectCheckValueFxn__C");
__FAR__ const CT__ti_sysbios_knl_Task_objectCheckValueFxn ti_sysbios_knl_Task_objectCheckValueFxn__C = ((const CT__ti_sysbios_knl_Task_objectCheckValueFxn)(ti_sysbios_knl_Task_getObjectCheckValue__I));

/* objectCheckFlag__C */
#pragma DATA_SECTION(ti_sysbios_knl_Task_objectCheckFlag__C, ".const:ti_sysbios_knl_Task_objectCheckFlag__C");
__FAR__ const CT__ti_sysbios_knl_Task_objectCheckFlag ti_sysbios_knl_Task_objectCheckFlag__C = 0;

/* startupHookFunc__C */
#pragma DATA_SECTION(ti_sysbios_knl_Task_startupHookFunc__C, ".const:ti_sysbios_knl_Task_startupHookFunc__C");
__FAR__ const CT__ti_sysbios_knl_Task_startupHookFunc ti_sysbios_knl_Task_startupHookFunc__C = ((const CT__ti_sysbios_knl_Task_startupHookFunc)NULL);


/*
 * ======== ti.sysbios.knl.Task_SupportProxy INITIALIZERS ========
 */


/*
 * ======== ti.sysbios.rom.cortexm.cc26xx.cc26x2v2.CC26xx INITIALIZERS ========
 */

/* Module__diagsEnabled__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsEnabled__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsEnabled__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsEnabled ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsEnabled__C = (xdc_Bits32)0x90;

/* Module__diagsIncluded__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsIncluded__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsIncluded__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsIncluded ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsIncluded__C = (xdc_Bits32)0x90;

/* Module__diagsMask__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsMask__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsMask__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsMask ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsMask__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__diagsMask)NULL);

/* Module__gateObj__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gateObj__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gateObj__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gateObj ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gateObj__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gateObj)NULL);

/* Module__gatePrms__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gatePrms__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gatePrms__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gatePrms ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gatePrms__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__gatePrms)NULL);

/* Module__id__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__id__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__id__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__id ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__id__C = (xdc_Bits16)0x32;

/* Module__loggerDefined__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerDefined__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerDefined__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerDefined ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerDefined__C = 0;

/* Module__loggerObj__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerObj__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerObj__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerObj ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerObj__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerObj)NULL);

/* Module__loggerFxn0__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn0__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn0__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn0 ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn0__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn0)NULL);

/* Module__loggerFxn1__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn1__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn1__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn1 ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn1__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn1)NULL);

/* Module__loggerFxn2__C */
#pragma DATA_SECTION(ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn2__C, ".const:ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn2__C");
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn2 ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn2__C = ((const CT__ti_sysbios_rom_cortexm_cc26xx_cc26x2v2_CC26xx_Module__loggerFxn2)NULL);

